const { Command } = require('@sapphire/framework');
const { EmbedBuilder } = require('discord.js');
const config = require('../../config');
class UserCommand extends Command {
	/**
	 * @param {Command.LoaderContext} context
	 */
	constructor(context) {
		super(context, {
			name: 'sendInfo',
			preconditions: ['OwnerOnly']
		});
	}

	/**
	 * @param {import('discord.js').Message} message
	 */
	async messageRun(message) {
		const rules = `ברוכים הבאים לשרת הדיסקורד של פייבאם.נטוורק, קהילת הפייבאם הישראלית

אנחנו קהילה שמתעסקת בפייבאם וכל דבר שקשור לפייבאם, על ידי [פייבאם.נטוורק](<https://${config.serverName}>), הפלטפורמה שתעזור לכם לפרסם את השרת/החנות שלכם בגוגל.
כאן תוכלו לשאול שאלות, ללמוד איך לפתח לפייבאם/למדל לפייבאם, למצוא את השרת הבא שלכם, חנות לקנות ממנה, חברת אחסון להשכיר ממנה, ועוד הרבה יותר!

_להלן חוקי שרת הדיסקורד של פייבאם.נטוורק, שימו לב כי כמו כן גם [תנאי השירות של דיסקורד של פייבאם.נטוורק](<https://discord.com/terms>) תקפים אצלנו._
1. שפת דיבור
שרת זה הינו שרת ישראלי, אז אנא השתדלו לדבר בעיקר בשפות עברית ואנגלית!
2. תוכן מיני
חל איסור מוחלט על פרסום תוכן מיני וגס בחדרי השרת כלל, עובר על חוק זה יורחק.
3. התחזות
אין להתחזות לדמות ציבורית או לחבר שרת כלל.
4. פרסום
חל איסור פרסום כל תוכן או קישור בשרת זה (מלבד בערוצים הנועדו לכך), גם אם מדובר בהודעה פרטית כל המפר יענש בהתאם.
5. פרטים אישיים
חל איסור מוחלט של פרסום כל פרט אישי על כל חבר שרת ללא הסכמתו המלאה. חל איסור פרסום כל מסמך אשר נועד לפרסם מידע שנלקח באופן זדוני או לא הולם (ידוע גם בתור Doxing). כל המפר יענש בחומרה.
6. ספאם
נא לא להפיץ את חדרי הצ'אטים של השרת עם גיפים וסטיקרים, או מספר הודעות רצופות.
7. הטרלות
יש אפס סבלנות לאלו שרוצים לעצבן אחרים, להטריל, וכדומה בשרת.
8. תכנות צד שלישי
אין להשתמש בתוכנות צד שלישיות לפגיעת חוויות משחק של חברי השרת או אירועים. אותו דבר פונה גם לסאונדפד.
9. הקשב לחברי הצוות
כל אנשי הצוות מחזיקים בזכות לנקוט בפעולה כלפי משתמש שעובר על אחד מהכללים, ומה שהם אומרים הוא סופי. אם אתה סבור שפעולותיו לא נחוצות או שנועדו לפגוע במשתמש אחר, אנא צור קשר עם האחראי עליהם.

_להלן ציפיות מהקהילה שלנו, שימו לב כי כמו כן גם [הנחיות הקהילה של דיסקורד](<https://discord.com/guidelines>) תקפים אצלנו._
1. כבד את האחר
כבדו אחד את השני בכל עת
2. שפה מכבדת
אנא דברו בשפה מכבדת בחדרי השרת, והשתמשו בשפה מכבדת שמדברים עם חברי שרת אחרים.
3. סביבה חברותית
השתדלו ליצור סביבה מועילה ותומכת עבור כל החברים. הצע סיוע והכוונה בעת הצורך.

שימו לב, במידה ותקבלו כמות עונשים מסויימת ייתכן ותקבלו הרחקה לצמיתות מהשרת.`;
		const embed = new EmbedBuilder()
			.setDescription(this.fixHebrewRTL(rules))
			.setColor(config.embed_color)
			.setAuthor({ name: 'פייבאם.נטוורק - חוקים כלליים', iconURL: message.guild.iconURL() })
			.setThumbnail(message.guild.iconURL())
			.setFooter({ text: `©️ ${config.serverName} 2021-2025`, iconURL: message.guild.iconURL() });
		await message.channel.send({ embeds: [embed] });
	}
	fixHebrewRTL(text) {
		return `\u202A${text}\u202C`;
	}
}

module.exports = {
	UserCommand
};
